In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
Ser1 = Series(np.arange(3),index=['a','b','c'])
Ser1

a    0
b    1
c    2
dtype: int32

In [4]:
Ser1.drop('b')

a    0
c    2
dtype: int32

In [5]:
dframe1 = DataFrame(np.arange(9).reshape((3,3)),index=['sf','ny','la'],
                    columns=['pop','sixe','year'])
dframe1

    pop  sixe  year
sf    0     1     2
ny    3     4     5
la    6     7     8

In [6]:
dframe1.drop('la')

    pop  sixe  year
sf    0     1     2
ny    3     4     5

In [7]:
dframe2 = dframe1.drop('la')

In [8]:
dframe2

    pop  sixe  year
sf    0     1     2
ny    3     4     5

In [9]:
dframe1

    pop  sixe  year
sf    0     1     2
ny    3     4     5
la    6     7     8

In [10]:
dframe1.drop('year',axis=1)

    pop  sixe
sf    0     1
ny    3     4
la    6     7